# RemoveCorrectionFactor Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingType..::..RemoveCorrectionFactor Method
TemperatureRatingType Class See Also
---
Remove an existing correction factor from this temperature rating type in Revit MEP project.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void RemoveCorrectionFactor(
	CorrectionFactor correctionFactor
)
```

Visual Basic
---
```text
Public Sub RemoveCorrectionFactor ( _
	correctionFactor As CorrectionFactor _
)
```

Visual C++
---
```text
public:
void RemoveCorrectionFactor(
	CorrectionFactor^ correctionFactor
)
```

# ### Parameters
correctionFactor
    Type: Autodesk.Revit.DB.Electrical..::..CorrectionFactorThe correction factor to be removed.
# ### Return Value
New constructed correction factor.
# See Also
TemperatureRatingType Class
Autodesk.Revit.DB.Electrical Namespace